betfair/templates/aus/BFExchangeService.getBetHistory.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/exchange/v5/'
xmlns:ns1='http://www.betfair.com/publicapi/v5/BFExchangeService/'>
<SOAP-ENV:Body>
<ns1:getBetHistory>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<betTypesIncluded>U</betTypesIncluded>
<detailed>false</detailed>
<eventTypeIds>
<ns2:int>0</ns2:int>
<ns2:int>0</ns2:int>
</eventTypeIds>
<marketId>0</marketId>
<locale></locale>
<timezone></timezone>
<marketTypesIncluded>
<ns2:MarketTypeEnum>O</ns2:MarketTypeEnum>
<ns2:MarketTypeEnum>O</ns2:MarketTypeEnum>
</marketTypesIncluded>
<placedDateFrom>2012-05-16T18:47:03Z</placedDateFrom>
<placedDateTo>2012-05-16T18:47:03Z</placedDateTo>
<recordCount>0</recordCount>
<sortBetsBy>NONE</sortBetsBy>
<startRecord>0</startRecord>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:getBetHistory>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
